app/controllers/medicamentos_controller.rb

SELECT "medicamentos".* FROM "medicamentos"
---
  def index
    @medicamentos = Medicamento.all

INSERT INTO "medicamentos" ("nome", "validade", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["nome", "Benegrip "], ["validade", "20/04/2018"], ["created_at", "2017-11-07 01:44:26.398576"], ["updated_at", "2017-11-07 01:44:26.398576"]]
---
  def create
    @medicamento = Medicamento.new(medicamento_params)

    respond_to do |format|
      if @medicamento.save

SELECT  "medicamentos".* FROM "medicamentos" WHERE "medicamentos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_medicamento
      @medicamento = Medicamento.find(params[:id])